{
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-ADDRESS",
    "4": "I-ADDRESS",
    "5": "B-PHONE",
    "6": "I-PHONE",
    "7": "B-EMAIL",
    "8": "I-EMAIL",
    "9": "B-AADHAAR",
    "10": "I-AADHAAR",
    "11": "B-PAN",
    "12": "I-PAN",
    "13": "B-PIN",
    "14": "I-PIN",
    "15": "B-DATE",
    "16": "I-DATE",
    "17": "B-FILE",
    "18": "I-FILE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AADHAAR": 9,
    "B-ADDRESS": 3,
    "B-DATE": 15,
    "B-EMAIL": 7,
    "B-FILE": 17,
    "B-PAN": 11,
    "B-PERSON": 1,
    "B-PHONE": 5,
    "B-PIN": 13,
    "I-AADHAAR": 10,
    "I-ADDRESS": 4,
    "I-DATE": 16,
    "I-EMAIL": 8,
    "I-FILE": 18,
    "I-PAN": 12,
    "I-PERSON": 2,
    "I-PHONE": 6,
    "I-PIN": 14,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
